cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(CpcRR, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x13);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst CpW;
  CpW.setOpcode(AVR32::CP_Wrr);
  CpW.addOperand(MCOperand::createReg(AVR32::R1));
  CpW.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(CpW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst CpWImm;
  CpWImm.setOpcode(AVR32::CP_Wri6);
  CpWImm.addOperand(MCOperand::createReg(AVR32::R1));
  CpWImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(CpWImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5b);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst CpWImm21;
  CpWImm21.setOpcode(AVR32::CP_Wri21);
  CpWImm21.addOperand(MCOperand::createReg(AVR32::R1));
  CpWImm21.addOperand(MCOperand::createImm(32));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(CpWImm21, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x41);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst Neg;
  Neg.setOpcode(AVR32::NEGr);
  Neg.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Neg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5c);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst Eor;
  Eor.setOpcode(AVR32::EORrr);
  Eor.addOperand(MCOperand::createReg(AVR32::R1));
  Eor.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Eor, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x51);

  MCInst Frs;
  Frs.setOpcode(AVR32::FRS);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Frs, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x43);

  MCInst Lsl;
  Lsl.setOpcode(AVR32::LSLrrr);
  Lsl.addOperand(MCOperand::createReg(AVR32::R1));
  Lsl.addOperand(MCOperand::createReg(AVR32::R2));
  Lsl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x09);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Lsr;
  Lsr.setOpcode(AVR32::LSRrrr);
  Lsr.addOperand(MCOperand::createReg(AVR32::R1));
  Lsr.addOperand(MCOperand::createReg(AVR32::R2));
  Lsr.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Max;
  Max.setOpcode(AVR32::MAXrrr);
  Max.addOperand(MCOperand::createReg(AVR32::R1));
  Max.addOperand(MCOperand::createReg(AVR32::R2));
  Max.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Max, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Min;
  Min.setOpcode(AVR32::MINrrr);
  Min.addOperand(MCOperand::createReg(AVR32::R1));
  Min.addOperand(MCOperand::createReg(AVR32::R2));
  Min.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Min, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0d);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst MulCompact;
  MulCompact.setOpcode(AVR32::MULrr);
  MulCompact.addOperand(MCOperand::createReg(AVR32::R1));
  MulCompact.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulCompact, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst MulImm;
  MulImm.setOpcode(AVR32::MULri8);
  MulImm.addOperand(MCOperand::createReg(AVR32::R1));
  MulImm.addOperand(MCOperand::createReg(AVR32::R2));
  MulImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x10);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst Mul;
  Mul.setOpcode(AVR32::MULrrr);
  Mul.addOperand(MCOperand::createReg(AVR32::R1));
  Mul.addOperand(MCOperand::createReg(AVR32::R2));
  Mul.addOperand(MCOperand::createReg(AVR32::R3));

