cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst MovImm;
  MovImm.setOpcode(AVR32::MOVri8);
  MovImm.addOperand(MCOperand::createReg(AVR32::R1));
  MovImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x3f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  std::unique_ptr<MCInstPrinter> InstPrinter(
      TheTarget->createMCInstPrinter(TT, /*SyntaxVariant=*/0, *MAI, *MII,
                                     *MRI));
  ASSERT_NE(InstPrinter.get(), nullptr);

  std::string Printed;
  raw_string_ostream OS(Printed);
  InstPrinter->printInst(&Nop, /*Address=*/0, /*Annot=*/"", *STI, OS);
  OS.flush();
  EXPECT_EQ(Printed, "\tnop");

  Printed.clear();
  raw_string_ostream AbsOS(Printed);
  InstPrinter->printInst(&Abs, /*Address=*/0, /*Annot=*/"", *STI, AbsOS);
  AbsOS.flush();
  EXPECT_EQ(Printed, "\tabs\tr1");

  Printed.clear();
  raw_string_ostream AcrOS(Printed);
  InstPrinter->printInst(&Acr, /*Address=*/0, /*Annot=*/"", *STI, AcrOS);
  AcrOS.flush();
  EXPECT_EQ(Printed, "\tacr\tr1");

  Printed.clear();
  raw_string_ostream AdcOS(Printed);
  InstPrinter->printInst(&Adc, /*Address=*/0, /*Annot=*/"", *STI, AdcOS);
  AdcOS.flush();
  EXPECT_EQ(Printed, "\tadc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddAbsOS(Printed);
  InstPrinter->printInst(&AddAbs, /*Address=*/0, /*Annot=*/"", *STI,
                         AddAbsOS);
  AddAbsOS.flush();
  EXPECT_EQ(Printed, "\taddabs\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddOS(Printed);
  InstPrinter->printInst(&Add, /*Address=*/0, /*Annot=*/"", *STI, AddOS);
  AddOS.flush();
  EXPECT_EQ(Printed, "\tadd\tr1, r2");

  Printed.clear();
  raw_string_ostream AndOS(Printed);
  InstPrinter->printInst(&And, /*Address=*/0, /*Annot=*/"", *STI, AndOS);
  AndOS.flush();
  EXPECT_EQ(Printed, "\tand\tr1, r2");

  Printed.clear();
  raw_string_ostream AndnOS(Printed);
  InstPrinter->printInst(&Andn, /*Address=*/0, /*Annot=*/"", *STI, AndnOS);
  AndnOS.flush();
  EXPECT_EQ(Printed, "\tandn\tr1, r2");

  Printed.clear();
  raw_string_ostream AsrOS(Printed);
  InstPrinter->printInst(&Asr, /*Address=*/0, /*Annot=*/"", *STI, AsrOS);
  AsrOS.flush();
  EXPECT_EQ(Printed, "\tasr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream BrevOS(Printed);
  InstPrinter->printInst(&Brev, /*Address=*/0, /*Annot=*/"", *STI, BrevOS);
  BrevOS.flush();
  EXPECT_EQ(Printed, "\tbrev\tr1");

  Printed.clear();
  raw_string_ostream CastsBOS(Printed);
  InstPrinter->printInst(&CastsB, /*Address=*/0, /*Annot=*/"", *STI, CastsBOS);
  CastsBOS.flush();
  EXPECT_EQ(Printed, "\tcasts.b\tr1");

  Printed.clear();
  raw_string_ostream CastsHOS(Printed);
  InstPrinter->printInst(&CastsH, /*Address=*/0, /*Annot=*/"", *STI, CastsHOS);
  CastsHOS.flush();
  EXPECT_EQ(Printed, "\tcasts.h\tr1");

  Printed.clear();
  raw_string_ostream CastuBOS(Printed);
  InstPrinter->printInst(&CastuB, /*Address=*/0, /*Annot=*/"", *STI, CastuBOS);
  CastuBOS.flush();
  EXPECT_EQ(Printed, "\tcastu.b\tr1");

  Printed.clear();
  raw_string_ostream CastuHOS(Printed);
  InstPrinter->printInst(&CastuH, /*Address=*/0, /*Annot=*/"", *STI, CastuHOS);
  CastuHOS.flush();
  EXPECT_EQ(Printed, "\tcastu.h\tr1");

  Printed.clear();
  raw_string_ostream ComOS(Printed);
  InstPrinter->printInst(&Com, /*Address=*/0, /*Annot=*/"", *STI, ComOS);
  ComOS.flush();
  EXPECT_EQ(Printed, "\tcom\tr1");

  Printed.clear();
  raw_string_ostream CpcOS(Printed);
  InstPrinter->printInst(&Cpc, /*Address=*/0, /*Annot=*/"", *STI, CpcOS);
  CpcOS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1");

  Printed.clear();
  raw_string_ostream CpcRROS(Printed);
  InstPrinter->printInst(&CpcRR, /*Address=*/0, /*Annot=*/"", *STI,
                         CpcRROS);
  CpcRROS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWOS(Printed);
  InstPrinter->printInst(&CpW, /*Address=*/0, /*Annot=*/"", *STI, CpWOS);
  CpWOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWImmOS(Printed);
  InstPrinter->printInst(&CpWImm, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImmOS);
  CpWImmOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, -1");

  Printed.clear();
  raw_string_ostream CpWImm21OS(Printed);
  InstPrinter->printInst(&CpWImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImm21OS);
  CpWImm21OS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, 32");

  Printed.clear();
  raw_string_ostream NegOS(Printed);
  InstPrinter->printInst(&Neg, /*Address=*/0, /*Annot=*/"", *STI, NegOS);
  NegOS.flush();
  EXPECT_EQ(Printed, "\tneg\tr1");

  Printed.clear();
  raw_string_ostream EorOS(Printed);
  InstPrinter->printInst(&Eor, /*Address=*/0, /*Annot=*/"", *STI, EorOS);
  EorOS.flush();
  EXPECT_EQ(Printed, "\teor\tr1, r2");

  Printed.clear();
  raw_string_ostream FrsOS(Printed);
  InstPrinter->printInst(&Frs, /*Address=*/0, /*Annot=*/"", *STI, FrsOS);
  FrsOS.flush();
  EXPECT_EQ(Printed, "\tfrs");

  Printed.clear();
  raw_string_ostream LslOS(Printed);
  InstPrinter->printInst(&Lsl, /*Address=*/0, /*Annot=*/"", *STI, LslOS);
  LslOS.flush();
  EXPECT_EQ(Printed, "\tlsl\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream LsrOS(Printed);
  InstPrinter->printInst(&Lsr, /*Address=*/0, /*Annot=*/"", *STI, LsrOS);
  LsrOS.flush();
  EXPECT_EQ(Printed, "\tlsr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MaxOS(Printed);
  InstPrinter->printInst(&Max, /*Address=*/0, /*Annot=*/"", *STI, MaxOS);
  MaxOS.flush();
  EXPECT_EQ(Printed, "\tmax\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MinOS(Printed);
  InstPrinter->printInst(&Min, /*Address=*/0, /*Annot=*/"", *STI, MinOS);
  MinOS.flush();
  EXPECT_EQ(Printed, "\tmin\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulCompactOS(Printed);
  InstPrinter->printInst(&MulCompact, /*Address=*/0, /*Annot=*/"", *STI,
                         MulCompactOS);
  MulCompactOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2");

