cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream MulImmOS(Printed);
  InstPrinter->printInst(&MulImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MulImmOS);
  MulImmOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream MulOS(Printed);
  InstPrinter->printInst(&Mul, /*Address=*/0, /*Annot=*/"", *STI, MulOS);
  MulOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulsDOS(Printed);
  InstPrinter->printInst(&MulsD, /*Address=*/0, /*Annot=*/"", *STI, MulsDOS);
  MulsDOS.flush();
  EXPECT_EQ(Printed, "\tmuls.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MuluDOS(Printed);
  InstPrinter->printInst(&MuluD, /*Address=*/0, /*Annot=*/"", *STI, MuluDOS);
  MuluDOS.flush();
  EXPECT_EQ(Printed, "\tmulu.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream OrOS(Printed);
  InstPrinter->printInst(&Or, /*Address=*/0, /*Annot=*/"", *STI, OrOS);
  OrOS.flush();
  EXPECT_EQ(Printed, "\tor\tr1, r2");

  Printed.clear();
  raw_string_ostream RolOS(Printed);
  InstPrinter->printInst(&Rol, /*Address=*/0, /*Annot=*/"", *STI, RolOS);
  RolOS.flush();
  EXPECT_EQ(Printed, "\trol\tr1");

  Printed.clear();
  raw_string_ostream RorOS(Printed);
  InstPrinter->printInst(&Ror, /*Address=*/0, /*Annot=*/"", *STI, RorOS);
  RorOS.flush();
  EXPECT_EQ(Printed, "\tror\tr1");

  Printed.clear();
  raw_string_ostream RsubOS(Printed);
  InstPrinter->printInst(&Rsub, /*Address=*/0, /*Annot=*/"", *STI, RsubOS);
  RsubOS.flush();
  EXPECT_EQ(Printed, "\trsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SbcOS(Printed);
  InstPrinter->printInst(&Sbc, /*Address=*/0, /*Annot=*/"", *STI, SbcOS);
  SbcOS.flush();
  EXPECT_EQ(Printed, "\tsbc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

  Printed.clear();
  raw_string_ostream SubOS(Printed);
  InstPrinter->printInst(&Sub, /*Address=*/0, /*Annot=*/"", *STI, SubOS);
  SubOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SwapBHOS(Printed);
  InstPrinter->printInst(&SwapBH, /*Address=*/0, /*Annot=*/"", *STI, SwapBHOS);
  SwapBHOS.flush();
  EXPECT_EQ(Printed, "\tswap.bh\tr1");

  Printed.clear();
  raw_string_ostream SwapBOS(Printed);
  InstPrinter->printInst(&SwapB, /*Address=*/0, /*Annot=*/"", *STI, SwapBOS);
  SwapBOS.flush();
  EXPECT_EQ(Printed, "\tswap.b\tr1");

  Printed.clear();
  raw_string_ostream SwapHOS(Printed);
  InstPrinter->printInst(&SwapH, /*Address=*/0, /*Annot=*/"", *STI, SwapHOS);
  SwapHOS.flush();
  EXPECT_EQ(Printed, "\tswap.h\tr1");

  Printed.clear();
  raw_string_ostream TstOS(Printed);
  InstPrinter->printInst(&Tst, /*Address=*/0, /*Annot=*/"", *STI, TstOS);
  TstOS.flush();
  EXPECT_EQ(Printed, "\ttst\tr1, r2");

  Printed.clear();
  raw_string_ostream MovOS(Printed);
  InstPrinter->printInst(&Mov, /*Address=*/0, /*Annot=*/"", *STI, MovOS);
  MovOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, r2");

  Printed.clear();
  raw_string_ostream MovImmOS(Printed);
  InstPrinter->printInst(&MovImm, /*Address=*/0, /*Annot=*/"", *STI, MovImmOS);
  MovImmOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, -1");

  SourceMgr SrcMgr;
  SrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "nop\nfrs\nabs r1\nacr r1\nadc r1, r2, r3\naddabs r1, r2, r3\nadd r1, r2\nand r1, r2\nandn r1, r2\nasr r1, r2, r3\nbrev r1\ncasts.b r1\ncasts.h r1\ncastu.b r1\ncastu.h r1\ncom r1\ncpc r1\ncpc r1, r2\ncp.w r1, r2\ncp.w r1, -1\ncp.w r1, 32\nneg r1\neor r1, r2\nlsl r1, r2, r3\nlsr r1, r2, r3\nmax r1, r2, r3\nmin r1, r2, r3\nmul r1, r2\nmul r1, r2, -1\nmul r1, r2, r3\nmuls.d r2, r3, r4\nmulu.d r2, r3, r4\nor r1, r2\nrol r1\nror r1\nrsub r1, r2\nsbc r1, r2, r3\nscr r1\nsub r1, r2\nswap.bh r1\nswap.b r1\nswap.h r1\ntst r1, r2\nmov r1, r2\nmov r1, -1\n"),
      SMLoc());

  MCContext ParseCtx(TT, *MAI, *MRI, *STI, &SrcMgr);
  std::unique_ptr<MCObjectFileInfo> MOFI(
      TheTarget->createMCObjectFileInfo(ParseCtx, /*PIC=*/false));
  ParseCtx.setObjectFileInfo(MOFI.get());

  std::unique_ptr<MCStreamer> Streamer(
      TheTarget->createNullStreamer(ParseCtx));
  std::unique_ptr<MCAsmParser> Parser(
      createMCAsmParser(SrcMgr, ParseCtx, *Streamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> TargetParser(
      TheTarget->createMCAsmParser(*STI, *Parser, *MII));
  ASSERT_NE(TargetParser.get(), nullptr);
  Parser->setTargetParser(*TargetParser);
  EXPECT_FALSE(Parser->Run(/*NoInitialTextSection=*/false));
}

} // namespace
